import math

import random



#2

#1. Визначте максимальне та мінімальне число серед заданих: 7, 22, 37, 16, 8.

print('max =', max(7, 22, 37, 16, 8))

print('min =', min(7, 22, 37, 16, 8))

#2. Початкове значення суми дорівнює 14. Додайте до неї такі числа: 23, 50, 37, 13.

print('Результат: ',sum([23, 50, 37, 13], 14 ))

#3. Визначте найближче більше ціле число 44,125.

print('Найближче більше ціле число: ', math.ceil(44.125))

#4. Знайдіть остачу від ділення числа 37 на 5.

print('Результат:', math.fmod(37, 5))

#5. Визначте випадкове число в діапазоні від 5 до 20.

print('Випадкове число у діапазоні від 5 до 20: ',random.randint(5,20))

#6. Виберіть випадкову літеру у слові «алгоритмізація».

print('Випадкова літера у слові «алгоритмізація».', random.choice("алгоритмізація"))

#7. Перетворіть дійсне число 46,7 і рядкове значення «78» у ціле число.

print(int(46.7),int("78"))

#8. Визначте значення чисел рі і е.

print('pi', math.pi,math.e)

#9.Складіть програму підсумування трьох випадкових чисел у діапазоні від 5 до 20

a = random.randint(5,20)

b = random.randint(5,20)

c = random.randint(5,20)

print('Випадкове число:', sum([a,b,c]))

#10.Дано числа: 7,45 і 16,4. Складіть програму визначення більшого числа та кореня з кожного з них.

if 7.45 > 16.4:
    print('7.45 > 16.4')
else:
    print('7.45 < 16.4')

print(math.sqrt(a))

print(math.sqrt(b))

   
   #3. Проект

   #Ви хочете придбати планшет та деякі аксесуари (сумку,клавіатуру та ін.). Спосіб оплати: 
   #сплачуєте 30% від суми при купівлі, а решту – 6-ма однаковими платежами.

print("Планшет - 7000 грн.")

tablet = 7000

print('Чехол - 300 грн')

case=300

print('Наушники - 1000 грн')

headphones = 1000

sum = tablet + case + headphones

print('Загальна вартість:',sum)

sumOfOrder = (sum*30) /100

print('Сума, при купівлі:', sumOfOrder)

sumOfOnePayment = (sum - int(sumOfOrder))/6

print('Сума одного платежу',sumOfOnePayment)

